tutorials/floatRigidBody/trial_cases/floatRigidBody_partioned_rho1140/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.25;
maxDeltaT       0.002;

functions
{
    sixDoF_History
    {
        type           sixDoFRigidBodyStateFvBeam;
        libs           ("libsixDoFRigidBodyStateFvBeam.so");
        angleFormat    radians;
        writeControl   runTime;
        writeInterval  0.01;
    }
    
    interfaceHeight1
    {
     	type            interfaceHeight;
	libs            ("libfieldFunctionObjects.so");
	locations       ((0.25 0.025 0) (0.75 0.025 0));
        alpha           alpha.water;
        writeControl   runTime;
	writeInterval  0.01;
    }
	      

}

// ************************************************************************* //
